
[
    {
        "id": "p1",
      "title": "Job portal application",
      "description": "Job Portal App is a full-stack MERN application designed to streamline the job search and hiring process. Built with JavaScript, TypeScript, Node.js, MongoDB, React, Express, and Auth0, this platform offers a seamless experience for both job seekers and employers. The application features secure authentication with Auth0, allowing users to create profiles, browse job listings, and apply for positions effortlessly. Employers can post, manage, and filter job listings with advanced search and sorting functionalities. Dynamic pagination ensures smooth navigation, while real-time data handling with Axios enhances performance.",
      "github": "https://github.com/Baisalov24/Job-Portal-App",
      "demo": "https://job-portal-app-tan.vercel.app/",
      "image": "jobPortalImg.jpg"      
    },
    {
        "id": "p2",
      "title": "Realtime chat application",
      "description": "Real-Time Chat App is a full-stack MERN application designed for seamless and instant communication. Built with JavaScript, Node.js, MongoDB, React, Express, and Socket.io, it enables real-time messaging, secure authentication, and an intuitive user experience.Users can create accounts, join private or group chats, and exchange messages instantly with WebSocket-powered live updates. The app supports dynamic chat creation, message persistence in MongoDB, and efficient state management for a smooth experience.",
      "github": "https://github.com/Baisalov24/realtime-chat-app",
      "demo": "https://realtime-chat-app-gmk4.onrender.com/login",
      "image":"realtimeChatImg.jpg"
    },
    {
        "id": "p3",
      "title": "Pizza application",
      "description": "This web application, designed for pizza sales, integrates the latest tech including React, Redux for state management, and Axios for data requests from a mock API. It offers features like pizza filtering, search functionality, and pagination, providing a streamlined ordering experience. Deployed on Vercel for testing, this project showcases a modern approach to online food ordering, demonstrating scalability and user-friendly design",
      "github": "https://github.com/Baisalov24/pizza-app",
      "demo": "https://pizza-app-theta-weld.vercel.app/",
      "image":"pizzaAppImg.bmp"
    }
  ]
